Repository: Siyuan-Xue/PixelDone-macOS
Catalog: PixelDoneApp/Localizable.xcstrings
Source language: en
Languages: ar, es, fr, ru, zh_hans

source: Review
ar: مراجعة
es: Revisar
fr: Examiner
ru: Проверить
zh_hans: 检查

source: Right
ar: اليمين
es: Derecha
fr: Droite
ru: Справа
zh_hans: 右侧

source: Same package + signature
ar: الحزمة والتوقيع نفسيهما
es: Mismo paquete y firma
fr: Même paquet et signature
ru: Тот же пакет и подпись
zh_hans: 相同软件包与签名

source: Save
ar: حفظ
es: Guardar
fr: Enregistrer
ru: Сохранить
zh_hans: 保存

source: Selected
ar: محدد
es: Seleccionado
fr: Sélectionné
ru: Выбрано
zh_hans: 已选择

# selected_count
source: %1$lld/%2$lld selected
ar: تم تحديد %1$lld/%2$lld
es: %1$lld/%2$lld seleccionadas
fr: %1$lld/%2$lld sélectionnées
ru: Выбрано %1$lld/%2$lld
zh_hans: 已选 %1$lld/%2$lld

source: Server update required
ar: يلزم تحديث الخادم
es: Se requiere actualizar el servidor
fr: Mise à jour du serveur requise
ru: Требуется обновление сервера
zh_hans: 需要更新服务器

# settings_about
source: About
ar: حول
es: Acerca de
fr: À propos
ru: О приложении
zh_hans: 关于

# settings_cloud
source: Cloud
ar: السحابة
es: Nube
ru: Облако
zh_hans: 云端

# settings_display
source: Display
ar: العرض
es: Pantalla
fr: Affichage
ru: Экран
zh_hans: 显示

# settings_dock
source: Dock
ar: الشريط السفلي
es: Barra inferior
fr: Barre inférieure
ru: Нижняя панель
zh_hans: 底栏

# settings_language
source: Language
ar: اللغة
es: Idioma
fr: Langue
ru: Язык
zh_hans: 语言

# settings_permissions
source: Permissions
ar: الأذونات
es: Permisos
fr: Autorisations
ru: Разрешения
zh_hans: 权限

# settings_theme
source: Theme
ar: السمة
es: Tema
fr: Thème
ru: Тема
zh_hans: 主题

# settings_updates
source: Updates
ar: التحديثات
es: Actualizaciones
fr: Mises à jour
ru: Обновления
zh_hans: 更新

source: Show
ar: إظهار
es: Mostrar
fr: Afficher
ru: Показать
zh_hans: 显示

source: Sign in
ar: تسجيل الدخول
es: Iniciar sesión
fr: Se connecter
ru: Войти
zh_hans: 登录

source: Sign out
ar: تسجيل الخروج
es: Cerrar sesión
fr: Se déconnecter
ru: Выйти
zh_hans: 退出登录

source: Sign up
ar: إنشاء حساب
es: Registrarse
fr: S’inscrire
ru: Регистрация
zh_hans: 注册

source: Signed in
ar: تم تسجيل الدخول
es: Sesión iniciada
fr: Connecté
ru: Выполнен вход
zh_hans: 已登录

source: Signed out
ar: تم تسجيل الخروج
es: Sesión cerrada
fr: Déconnecté
ru: Вход не выполнен
zh_hans: 未登录

source: Signing in
ar: جارٍ تسجيل الدخول
es: Iniciando sesión
fr: Connexion
ru: Вход
zh_hans: 登录中

source: Signing up
ar: جارٍ التسجيل
es: Registrando
fr: Inscription
ru: Регистрация
zh_hans: 注册中

source: Snooze 10
ar: غفوة 10
es: Posponer 10
fr: Reporter de 10
ru: Отложить на 10
zh_hans: 稍后 10 分钟

source: Snooze all 10
ar: غفوة الكل 10
es: Posponer todo 10
fr: Tout reporter de 10
ru: Отложить все на 10
zh_hans: 全部稍后 10 分钟

source: Sort
ar: ترتيب
es: Ordenar
fr: Trier
ru: Сортировка
zh_hans: 排序

# sort_detail
source: Priority / time
ar: الأولوية / الوقت
es: Prioridad / hora
fr: Priorité / heure
ru: Приоритет / время
zh_hans: 优先级 / 时间

source: Stable
ar: مستقر
es: Estable
ru: Стабильно
zh_hans: 稳定

# status_active
source: Active
ar: نشط
es: Activa
ru: Активна
zh_hans: 未完成

# status_completed
source: Completed
ar: مكتمل
es: Completada
fr: Terminée
ru: Выполнена
zh_hans: 已完成

source: Stop
ar: إيقاف
es: Detener
fr: Arrêter
ru: Остановить
zh_hans: 停止

source: Stop all
ar: إيقاف الكل
es: Detener todo
fr: Tout arrêter
ru: Остановить все
zh_hans: 全部停止

source: Sync
ar: المزامنة
es: Sincronización
fr: Synchronisation
ru: Синхронизация
zh_hans: 同步

source: Sync conflicts
ar: تعارضات المزامنة
es: Conflictos de sincronización
fr: Conflits de synchronisation
ru: Конфликты синхронизации
zh_hans: 同步冲突

source: Sync failed.
ar: فشلت المزامنة.
es: Error de sincronización.
fr: Échec de la synchronisation.
ru: Ошибка синхронизации.
zh_hans: 同步失败。

# sync_network_error_detail
source: Network unavailable. Check Wi-Fi, mobile data, or VPN.
ar: الشبكة غير متاحة. تحقق من Wi-Fi أو بيانات الهاتف أو VPN.
es: Red no disponible. Comprueba Wi-Fi, datos móviles o VPN.
fr: Réseau indisponible. Vérifiez le Wi-Fi, les données mobiles ou le VPN.
ru: Сеть недоступна. Проверьте Wi-Fi, мобильную сеть или VPN.
zh_hans: 网络不可用。请检查 Wi-Fi、移动数据或 VPN。

source: Sync now
ar: مزامنة الآن
es: Sincronizar ahora
fr: Synchroniser
ru: Синхронизировать
zh_hans: 立即同步

# sync_pending_changes
source: Pending changes.
ar: تغييرات معلقة.
es: Cambios pendientes.
fr: Modifications en attente.
ru: Есть ожидающие изменения.
zh_hans: 有待同步更改。

source: Sync sign in
ar: دخول المزامنة
es: Acceso de sincronización
fr: Connexion de synchronisation
ru: Вход для синхронизации
zh_hans: 登录同步

# sync_sign_in_first
source: Sign in first.
ar: سجّل الدخول أولاً.
es: Inicia sesión primero.
fr: Connectez-vous d’abord.
ru: Сначала войдите.
zh_hans: 请先登录。

# sync_sign_in_required
source: Sign in required
ar: يلزم تسجيل الدخول
es: Inicio de sesión requerido
fr: Connexion requise
ru: Требуется вход
zh_hans: 需要登录

source: Sync sign up
ar: تسجيل المزامنة
es: Registro de sincronización
fr: Inscription de synchronisation
ru: Регистрация для синхронизации
zh_hans: 注册同步

source: Synced
ar: تمت المزامنة
es: Sincronizado
fr: Synchronisé
ru: Синхронизировано
zh_hans: 已同步

source: Syncing
ar: جارٍ المزامنة
es: Sincronizando
fr: Synchronisation
ru: Синхронизация
zh_hans: 同步中

source: Target list
ar: القائمة الهدف
es: Lista de destino
fr: Liste cible
ru: Целевой список
zh_hans: 目标清单

source: Task image
ar: صورة المهمة
es: Imagen de la tarea
fr: Image de la tâche
ru: Изображение задачи
zh_hans: 待办图片

source: Task image preview
ar: معاينة صورة المهمة
es: Vista previa de la imagen
fr: Aperçu de l’image
ru: Предпросмотр изображения
zh_hans: 待办图片预览

# tasks_due
source: %lld tasks due
ar: %lld مهمة مستحقة
es: %lld tareas vencidas
fr: %lld tâches échues
ru: Срок %lld задачи наступил
zh_hans: %lld 个待办到期

# theme_dark
source: Dark
ar: داكن
es: Oscuro
fr: Sombre
ru: Тёмная
zh_hans: 深色

# theme_light
source: Light
ar: فاتح
es: Claro
fr: Clair
ru: Светлая
zh_hans: 浅色

source: This device
ar: هذا الجهاز
es: Este dispositivo
fr: Cet appareil
ru: Это устройство
zh_hans: 此设备

source: Time
ar: الوقت
es: Hora
fr: Heure
ru: Время
zh_hans: 时间

source: Time / alarm
ar: الوقت / المنبه
es: Hora / alarma
fr: Heure / alarme
ru: Время / будильник
zh_hans: 时间 / 闹钟

source: Todo due
ar: مهمة مستحقة
es: Tarea vencida
fr: Tâche échue
ru: Срок задачи наступил
zh_hans: 待办到期

source: Toggle deadline
ar: تبديل الموعد
es: Cambiar plazo
fr: Changer l’échéance
ru: Переключить срок
zh_hans: 切换截止时间

source: Toggle done visibility
ar: تبديل ظهور المكتملة
es: Cambiar visibilidad de completadas
fr: Changer la visibilité des tâches terminées
ru: Переключить видимость готовых
zh_hans: 切换已完成项显示

# toggle_quick_delete
source: Toggle row quick delete
ar: تبديل الحذف السريع للصف
es: Cambiar borrado rápido por fila
fr: Changer la suppression rapide par ligne
ru: Переключить быстрое удаление
zh_hans: 切换行快速删除

source: Toggle sort
ar: تبديل الترتيب
es: Cambiar orden
fr: Changer le tri
ru: Переключить сортировку
zh_hans: 切换排序

# trash_empty
source: Trash is empty.
ar: سلة المهملات فارغة.
es: La papelera está vacía.
fr: La corbeille est vide.
ru: Корзина пуста.
zh_hans: 垃圾桶为空。

# trash_retention
source: Items are retained for 30 days, then permanently deleted.
ar: يتم الاحتفاظ بالعناصر لمدة 30 يومًا، ثم حذفها نهائيًا.
es: Los elementos se conservan 30 días y luego se eliminan para siempre.
fr: Les éléments sont conservés 30 jours, puis supprimés définitivement.
ru: Элементы хранятся 30 дней, затем удаляются навсегда.
zh_hans: 条目在垃圾桶中保留 30 天，之后将永久删除。

source: Update
ar: تحديث
es: Actualizar
fr: Mettre à jour
ru: Обновить
zh_hans: 更新

source: Update available
ar: يتوفر تحديث
es: Actualización disponible
fr: Mise à jour disponible
ru: Доступно обновление
zh_hans: 有可用更新

# update_available_detail
source: PixelDone can update from v%1$@ to v%2$@.
ar: يمكن تحديث PixelDone من v%1$@ إلى v%2$@.
es: PixelDone puede actualizarse de v%1$@ a v%2$@.
fr: PixelDone peut passer de v%1$@ à v%2$@.
ru: PixelDone можно обновить с v%1$@ до v%2$@.
zh_hans: PixelDone 可从 v%1$@ 更新至 v%2$@。

source: Update failed
ar: فشل التحديث
es: Error de actualización
fr: Échec de la mise à jour
ru: Ошибка обновления
zh_hans: 更新失败

source: Update permissions
ar: أذونات التحديث
es: Permisos de actualización
fr: Autorisations de mise à jour
ru: Разрешения обновления
zh_hans: 更新权限

source: Update popup
ar: نافذة التحديث
es: Aviso de actualización
fr: Fenêtre de mise à jour
ru: Окно обновления
zh_hans: 更新弹窗

source: Use cloud version
ar: استخدام إصدار السحابة
es: Usar versión en la nube
fr: Utiliser la version cloud
ru: Использовать облачную версию
zh_hans: 使用云端版本

source: Use this device
ar: استخدام إصدار هذا الجهاز
es: Usar este dispositivo
fr: Utiliser cet appareil
ru: Использовать с устройства
zh_hans: 使用此设备版本

# verifying_update
source: Verifying update integrity…
ar: جارٍ التحقق من سلامة التحديث…
es: Verificando la integridad de la actualización…
fr: Vérification de l’intégrité de la mise à jour…
ru: Проверка целостности обновления…
zh_hans: 正在校验更新完整性…

source: View task image
ar: عرض صورة المهمة
es: Ver imagen de la tarea
fr: Voir l’image de la tâche
ru: Открыть изображение задачи
zh_hans: 查看待办图片

# waiting_for_installer
source: Waiting for Android install confirmation…
ar: بانتظار تأكيد التثبيت من Android…
es: Esperando la confirmación de instalación de Android…
fr: En attente de la confirmation d’installation Android…
ru: Ожидание подтверждения установки Android…
zh_hans: 正在等待 Android 安装确认…

# widget_all_done
source: All done
ar: اكتمل الكل
es: Todo hecho
fr: Tout est terminé
ru: Всё выполнено
zh_hans: 全部完成

# widget_choose_list
source: Choose a list
ar: اختر قائمة
es: Elegir una lista
fr: Choisir une liste
ru: Выберите список
zh_hans: 选择清单

# widget_choose_list_detail
source: This widget will show unfinished tasks from the selected list.
ar: ستعرض الأداة المهام غير المكتملة من القائمة المحددة.
es: El widget mostrará las tareas pendientes de la lista elegida.
fr: Le widget affichera les tâches inachevées de la liste choisie.
ru: Виджет покажет незавершённые задачи выбранного списка.
zh_hans: 小组件将显示所选清单中的未完成待办。

# widget_complete_task
source: Complete %1$@
ar: إكمال %1$@
es: Completar %1$@
fr: Terminer %1$@
ru: Завершить %1$@
zh_hans: 完成 %1$@

# widget_description
source: View and complete unfinished tasks from one list.
ar: اعرض المهام غير المكتملة وأكملها من قائمة واحدة.
es: Consulta y completa tareas pendientes de una lista.
fr: Consultez et terminez les tâches d’une liste.
ru: Просматривайте и завершайте задачи одного списка.
zh_hans: 在桌面查看并完成一个清单中的未完成待办。

# widget_empty_detail
source: Choose a list to see its unfinished tasks.
ar: اختر قائمة لعرض مهامها غير المكتملة.
es: Elige una lista para ver sus tareas pendientes.
fr: Choisissez une liste pour voir ses tâches inachevées.
ru: Выберите список, чтобы увидеть незавершённые задачи.
zh_hans: 选择一个清单以查看未完成待办。

# widget_list_icon_description
source: Checklist
ar: قائمة مهام
es: Lista de tareas
fr: Liste de tâches
ru: Список задач
zh_hans: 清单

# widget_list_missing
source: List unavailable
ar: القائمة غير متاحة
es: Lista no disponible
fr: Liste indisponible
ru: Список недоступен
zh_hans: 清单不可用

# widget_list_missing_detail
source: The saved list no longer exists.
ar: لم تعد القائمة المحفوظة موجودة.
es: La lista guardada ya no existe.
fr: La liste enregistrée n’existe plus.
ru: Сохранённого списка больше нет.
zh_hans: 已保存的清单已不存在。

# widget_more_items
source: %1$lld more
ar: %1$lld أخرى
es: %1$lld más
fr: %1$lld de plus
ru: Ещё %1$lld
zh_hans: 还有 %1$lld 项

# widget_name
source: PixelDone list
ar: قائمة PixelDone
es: Lista de PixelDone
fr: Liste PixelDone
ru: Список PixelDone
zh_hans: PixelDone 清单

# widget_no_lists
source: Create a list in PixelDone first.
ar: أنشئ قائمة في PixelDone أولاً.
es: Crea primero una lista en PixelDone.
fr: Créez d’abord une liste dans PixelDone.
ru: Сначала создайте список в PixelDone.
zh_hans: 请先在 PixelDone 中创建清单。

# widget_preview_task_one
source: Plan the day
ar: خطط لليوم
es: Planificar el día
fr: Planifier la journée
ru: Спланировать день
zh_hans: 规划今天

# widget_preview_task_three
source: Send the update
ar: أرسل التحديث
es: Enviar la actualización
fr: Envoyer la mise à jour
ru: Отправить обновление
zh_hans: 发送更新

# widget_preview_task_two
source: Review notes
ar: راجع الملاحظات
es: Revisar notas
fr: Relire les notes
ru: Просмотреть заметки
zh_hans: 整理笔记

# widget_reconfigure
source: Choose another list
ar: اختر قائمة أخرى
es: Elegir otra lista
fr: Choisir une autre liste
ru: Выбрать другой список
zh_hans: 选择其他清单

# widget_save
source: Add widget
ar: إضافة الأداة
es: Añadir widget
fr: Ajouter le widget
ru: Добавить виджет
zh_hans: 添加小组件

# widget_save_failed
source: Couldn’t update the widget. Try again.
ar: تعذر تحديث الأداة. حاول مرة أخرى.
es: No se pudo actualizar el widget. Inténtalo de nuevo.
fr: Impossible de mettre à jour le widget. Réessayez.
ru: Не удалось обновить виджет. Повторите попытку.
zh_hans: 无法更新小组件，请重试。

# widget_saving
source: Saving…
ar: جارٍ الحفظ…
es: Guardando…
fr: Enregistrement…
ru: Сохранение…
zh_hans: 正在保存…

# widget_select_list
source: Tap to choose a list
ar: اضغط لاختيار قائمة
es: Toca para elegir una lista
fr: Touchez pour choisir une liste
ru: Нажмите, чтобы выбрать список
zh_hans: 点击选择要显示的清单

# widget_show_list
source: Show this list
ar: عرض هذه القائمة
es: Mostrar esta lista
fr: Afficher cette liste
ru: Показать этот список
zh_hans: 显示此清单

source: XHIGH alarm ringing
ar: منبه XHIGH يرن
es: Alarma XHIGH sonando
fr: Alarme XHIGH en cours
ru: Сигнал XHIGH
zh_hans: 超高优先级闹钟响铃中

# xhigh_alarms_count
source: %lld XHIGH alarms
ar: %lld منبه XHIGH
es: %lld alarmas XHIGH
fr: %lld alarmes XHIGH
ru: %lld сигнала XHIGH
zh_hans: %lld 个超高优先级闹钟

source: XHIGH task due
ar: مهمة XHIGH مستحقة
es: Tarea XHIGH vencida
fr: Tâche XHIGH échue
ru: Срок задачи XHIGH наступил
zh_hans: 超高优先级待办到期

# xhigh_tasks_due
source: %lld XHIGH tasks due
ar: %lld مهام XHIGH مستحقة
es: %lld tareas XHIGH vencidas
fr: %lld tâches XHIGH échues
ru: Срок %lld задачи XHIGH наступил
zh_hans: %lld 个超高优先级待办到期
